const results = {
    "maths": [
        {
            "part": "Часть 1:",
            "answer": "Назовите самую красивую, самую известную, самую величественную \"царицу\" математики.",
            "answers": ["арифметика", "стереометрия", "геометрия", "математика"],
            "correct": "0"
        },
        {
            "answer": "Вторая координата точки.",
            "answers": ["ордината", "абсцисс"],
            "correct": "0"
        },
        {
            "answer": "График функции у = kx + b.",
            "answers": ["прямая", "гипотенуза", "парабола", "гипербола"],
            "correct": "0"
        },
        {
            "answer": "Может ли при умножении получиться ноль?",
            "answers": ["да", "нет"],
            "correct": "0"
        },
        {
            "answer": "Чему равна четверть часа?",
            "answers": ["30 мин", "15 мин", "45 мин"],
            "correct": "1"
        },
        {
            "answer": "Сумма углов треугольника.",
            "answers": ["360°", "180°"],
            "correct": "1"
        },
        {
            "answer": "Сумма длин всех сторон многоугольника.",
            "answers": ["периметр", "площадь"],
            "correct": "0"
        },
        {
            "answer": "Переведите на древнегреческий язык слова «натянутая тетива».",
            "answers": ["гипотенуза", "высота", "медиана"],
            "correct": "0"
        },
        {
            "answer": "Прибор для построения окружности.",
            "answers": ["линейка", "транспортир", "циркуль"],
            "correct": "2"
        },
        {
            "answer": "Отрезок, соединяющий точку окружности с центром.",
            "answers": ["диаметр", "радиус", "хорда"],
            "correct": "1"
        },
        {
            "part": "Часть 2:",
            "answer": "Какое из чисел x или y больше, если x – y = -8.",
            "answers": ["x", "y"],
            "correct": "1"
        },
        {
            "answer": "Известно, что a < b и b < c. Какое из утверждений верно:",
            "answers": ["a > c", "a = c", "c > a"],
            "correct": "2"
        },
        {
            "answer": "Решите неравенствo -2x^2 – 5x + 18 >= 0. Какой из ответов правильный:",
            "answers": ["(-4,5; 2)", "[-4,5; 2]", "(-10; 0)", "[0; 2]"],
            "correct": "1"
        },
        {
            "answer": "Найдите множество решений неравенства 7x^2 <= 4x.",
            "answers": ["нет решений", "[-7; 7]", "(-7; 7)", "(-5; 0)"],
            "correct": "0"
        },
        {
            "answer": "Поезд двигаясь равномерно со скоростью 75 км/ч, проезжает мимо пешехода, идущего параллельно путям со скоростью 3 км/ч навстречу поезду, за 30 секунд. Найдите длину поезда в метрах.",
            "answers": ["650", "240", "498", "700"],
            "correct": "0"
        },
        {
            "answer": "Найдите расстояние между точками А и В, если А (2; 7); В (-2;7).",
            "answers": ["4", "16", "3", "5"],
            "correct": "0"
        },
        {
            "answer": "Найдите координаты вектора a + b, если а {3; -4}, в {1; 5}.",
            "answers": ["{4; 1}", "{3; 2}", "{5; 3}", "{5; 7}"],
            "correct": "0"
        },
        {
            "answer": "В треугольнике ABC угол BAC = 86°, AD – биссектриса. Найдите угол BAD.",
            "answers": ["43°", "54°", "20°", "90°"],
            "correct": "0"
        },
        {
            "answer": "Сторона ромба равна 14, а один из углов этого ромба равен 150°. Найдите высоту этого ромба.",
            "answers": ["7", "10", "4", "12"],
            "correct": "0"
        },
        {
            "answer": "Прямая, параллельная стороне АС треугольника АВС, пересекает стороны АВ и ВС в точках М и N соответственно. Найдите ВN, MN = 15, <div><span>AC = 25, NC = 22.</span></div>",
            "answers": ["23", "18", "43", "33"],
            "correct": "3"
        },
    ],
    "russian_language": [
        {
            "part": "Часть 1:",
            "answer": "Что такое прилагательное?",
            "answers": ["именительный падеж единственного числа мужского рода", "это самостоятельная часть речи, которая обозначает количество и порядок предметов при счёте", "другое...", "это самостоятельная часть речи, которая обозначает признак предмета"],
            "correct": "3"
        },
        {
            "answer": "Что такое существительное?",
            "answers": ["это самостоятельная часть речи, которая обозначает предмет", "именительный падеж единственного числа", "это самостоятельная часть речи, которая указывает на предметы, признаки и количество, но не называет их", "другое..."],
            "correct": "0"
        },
        {
            "answer": "Что такое глагол?",
            "answers": ["другое...", "неопределённая форма глагола", "самостоятельная часть речи, которая обозначает состояние или действие предмета", "самостоятельная часть речи, которая обозначает проявляющийся во времени признак предмета по действию"],
            "correct": "2"
        },
        {
            "answer": "Что такое союз?",
            "answers": ["другое...", "это служебная часть речи, которая служит для связи однородных членов предложения, для связи простых предложений в составе сложного и для связи разных частей текста", "служебная часть речи, которая стоит перед словами, изменяемыми по падежам, и служит для связи слов в предложении", "это особая часть речи, которая выражает, но не называет различные чувства и побуждения"],
            "correct": "1"
        },
        {
            "answer": "К какому спряжению относятся окончания -ущ-, -ющ-?",
            "answers": ["к I - му спряжению", "ко II - му спряжению"],
            "correct": "0"
        },
        {
            "answer": "\"ж.. - ш..\" пиши с буквой ..",
            "answers": ["ы", "и"],
            "correct": "1"
        },
        {
            "answer": "Какое из этих слов написано с ошибкой?",
            "answers": ["чугунный", "стеклянный", "оловянный", "серебрянный"],
            "correct": "3"
        },
        {
            "answer": "Какие виды придаточных предложений отвечают на вопросы падежей?",
            "answers": ["определительные", "изъяснительные", "обстоятельственные"],
            "correct": "1"
        },
        {
            "answer": "18 - ая буква алфавита:",
            "answers": ["Мм", "Сс", "Аа", "Рр"],
            "correct": "3"
        },
        {
            "answer": "Кто вместе со Шведовым написал \"Толковый словарь русского языка\"?",
            "answers": ["С. И. Ожегов", "Д. Н. Ушаков", "С. А. Кузнецов", "В. И. Даль"],
            "correct": "0"
        },
        {
            "part": "Часть 2:",
            "answer": "Выполните синтаксический анализ предложений текста. Прочитайте текст. <div><span>(1)Мадагаскар отделился от Африки 120 000 000 лет назад и с тех пор пошёл по своему эволюционному пути развития. (2)В результате этого животные и растения, которых вы не встретите больше нигде в мире, успешно выжили и процветают на этом острове — четвёртом по величине в мире. (З)Например, лемуры, которые уже давно исчезли в Европе и Северной Америке. (4)Первые люди появились на Мадагаскаре только две тысячи лет назад — своего рода эволюционный ход, позволивший проследить на примере острова, как влияет человек на природу. (5)Команда Кусто исследовала остров и собрала огромный материал об этом удивительном заповеднике уникальных жизненных форм, не упустив из виду ни его внутренние территории, ни побережье.</span></div><div><span>Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.</span></div>",
            "answers": ["мадагаскар отделился (и) пошёл (предложение 1)", "животные выжили (и) процветают (предложение 2)", "Команда Кусто (предложение 5)", "лемуры исчезли (предложение 3)"],
            "correct": "0"
        },
        {
            "answer": "Выполните орфографический анализ слов. Укажите вариант ответа, в котором дано верное объяснение написания выделенного слова.",
            "answers": ["СЪЯЗВИТЬ — разделительный твёрдый знак пишется после приставок на согласную перед буквами Е, Ё, Ю, Я, И.", "ДОКРАСНА — в наречиях, образованных приставочно-суффиксальным способом от имён существительных с помощью приставок ИЗ-, ДО-, С-, на конце пишется буква А.", "СЛЫШИМЫЙ — в суффиксе страдательного причастия, образованного от глагола I спряжения, пишется буквы И", "СТАРОЖИЛЫ — написание безударной гласной А в корне слова необходимо запомнить."],
            "correct": "1"
        },
        {
            "answer": "Расставьте знаки препинания.<div><span>Жаворонки (1) едва различимые (2) в воздухе (3) заливались над степью (4) конца и края которой (5) не было видно (6) и сообщали (7) ещё не проснувшимся (8) жителям о долгожданном восходе солнца.</span></div><div><span>Укажите цифры, на месте которых в предложении должны стоять запятые.</span></div>",
            "answers": ["148", "2378", "1346", "2568"],
            "correct": "2"
        },
        {
            "answer": "Прочитайте текст.<div><span>(1)Единственными очагами древнерусской письменной культуры среди океана тьмы и невежества считались монастыри, где переписывали священные тексты и вели летописи на пергаменте – недублёной коже животных. (2)Кроме того, археологами найдено уже большое количество древнерусских грамот, написанных на берёзовой коре – бересте. (3)После тщательного изучения этих берестяных писем и записок учёные смогли предположить, что население Новгорода было грамотным по крайней мере начиная с XI века. (4)«В то время как наши предки высекали слова на камнях, славяне уже писали друг другу письма». (5)Это сообщение было опубликовано в одной из шведских газет, когда берестяные грамоты выставлялись в Швеции.</span></div><div><span>Укажите верные варианты ответов.</span></div><div><span>1. Вторая часть сложного предложения 1 осложнена обособленным приложением.</span></div><div><span>2. Предложение 2 является односоставным безличным.</span></div><div><span>3. Грамматическая основа в первой части сложного предложения 3 – учёные смогли.</span></div><div><span>4. Предложение 4 сложноподчинённое с придаточным времени.</span></div><div><span>5. Сказуемое в первой части предложения 5 составное глагольное.</span></div><div><span>Запишите номера выбранных вариантов без пробелов и запятых.</span></div>",
            "answers": ["25", "21", "34", "14"],
            "correct": "3"
        },
        {
            "answer": "Укажите номера предложений, в которых средством выразительности речи является метафора.<div><span>1) Я пришёл, чтобы отдать себя в руки правосудия!</span></div><div><span>2) Ну что… ни одно доброе дело не остается безнаказанным?</span></div><div><span>3) Я не верила, что диктанты вытащил он, но директор согласился с версией Вани.</span></div><div><span>4) Трудно было отыскать людей, более не похожих друг на друга, чем Ваня и Сенька.</span></div><div><span>5) Когда Сеня, путаясь и напрягаясь, блуждал по лабиринтам знаменитых четверостиший, Ваня страдал.</span></div>",
            "answers": ["12", "15", "1", "45"],
            "correct": "1"
        },
        {
            "answer": "Что из этого эпитет?",
            "answers": ["багровый костёр заката", "спит земля в сиянье голубом", "ваш шпиц, прелестный шпиц, не более напёрстка!", "сквозь волнистые туманы пробирается луна, на печальные поляны льёт печально свет она"],
            "correct": "3"
        },
        {
            "answer": "Что из этого синекдоха",
            "answers": ["ну что ж, садись, светило", "пустых небес прозрачное стекло", "в сто тысяч солнц закат пылал", "досадно было, боя ждали"],
            "correct": "0"
        },
        {
            "answer": "Лексические средства русского языка - это...",
            "answers": ["антонимы", "фигуры речи", "тропы", "синонимы"],
            "correct": "2"
        },
        {
            "answer": "Словосочетание - это...",
            "answers": ["другое...", "вид подчинительной связи", "сказуемое, которое состоит из вспомогательного глагола и инфинитива", "это соединение двух или более самостоятельных слов, связанных друг с другом подчинительной связью по смыслу и грамматически"],
            "correct": "3"
        },
        {
            "part": "Вопрос по литературе",
            "answer": "Главный герой романа \"Герой нашего времени\"?",
            "answers": ["Максим Максимыч", "Печорин", "Печёрин", "Сам автор"],
            "correct": "1"
        },
    ],
    "informatics": [
        {
            "part": "Часть 1:",
            "answer": "Что такое информатика?",
            "answers": ["любое словесное высказывание, напечатанное, написанное или существующее в устной форме", "совокупность всех прикладных программ", "наука, занимающаяся изучением всевозможных способов передачи, хранения и обработки информации. Хранить, обрабатывать и передавать информацию человеку помогает компьютер", "фундаментальная наука, предоставляющая (общие) языковые средства другим наукам"],
            "correct": "2"
        },
        {
            "answer": "Что такое код?",
            "answers": ["система условных знаков для представления информации", "список команд, выбирая которые, пользователь может управлять компьютером", "материальный объект, используемый для хранения на нём информации", "запись информации с использованием определённого кода"],
            "correct": "0"
        },
        {
            "answer": "Что такое компьютерная графика?",
            "answers": ["произвольная последовательность символов, ограниченная специальными символами", "разные виды графических изображений, создаваемых или обрабатываемых с помощью компьютера", "сведения об окружающем нас мире", "любое словесное высказывание, напечатанное, написанное или существующее в устной форме"],
            "correct": "1"
        },
        {
            "answer": "Что такое процессор?",
            "answers": ["область экрана, в которой происходит работа с конкретной программой. Когда программа запущена, то говорят, что её окно открыто", "изображение на экране монитора готового к работе компьютера", "предназначен для вычислений, обработки информации и управления работой компьютера", "произвольная последовательность символов между левой и правой границами документа"],
            "correct": "2"
        },
        {
            "answer": "Что такое память человечества?",
            "answers": ["содержит все знания, которые накопили люди за время своего существования и которыми могут воспользоваться ныне живущие люди", "органы чувств человека, а также телефон, радио, телевидение, компьютер. С их помощью люди обмениваются информацией", "информация, представленная в форме, пригодной для обработки компьютером", "раздел диалогового окна"],
            "correct": "0"
        },
        {
            "answer": "С помощью каких клавиш можно быстро перемещаться по тексту?",
            "answers": ["Ctrl + R", "Ctrl + H", "Ctrl + J", "Ctrl + \"-->\"; Ctrl + \"<--\""],
            "correct": "3"
        },
        {
            "answer": "Клавиши для \"быстрого написания любых сочинений\".",
            "answers": ["Ctrl + C; Ctrl + V", "Ctrl + P", "Ctrl + Shift + клик", "Shift + F5"],
            "correct": "0"
        },
        {
            "answer": "С чего начинается описание массива?",
            "answers": ["for i := 1 to N", "write (A[i], ' ')", "var A: array", "const N = ..."],
            "correct": "3"
        },
        {
            "answer": "Сколько будет 20 div 4?",
            "answers": ["6", "0", "10", "5"],
            "correct": "3"
        },
        {
            "answer": "Сколько будет 15 mod 4?",
            "answers": ["3", "7", "2", "4"],
            "correct": "0"
        },
        {
            "part": "Часть 2:",
            "answer": "Для какого из приведённых чисел ложно высказывание: НЕ (число < 80) ИЛИ (число нечётное)?",
            "answers": ["29", "52", "80", "91"],
            "correct": "1"
        },
        {
            "answer": "В одной из кодировок Unicode каждый символ кодируется 32 битами. Определите размер следующего предложения в данной кодировке. Конец аллеи опять с утра исчез в пыли, опять серебряные змеи через сугробы поползли.",
            "answers": ["84 бит", "336 байт", "672 бит", "2688 байт"],
            "correct": "1"
        },
        {
            "answer": "На компьютере в офисе туристической фирмы в каталоге Экскурсии хранился файл Байкал.png. Этот каталог перенесли в каталог Реклама, расположенный в корне диска D. Укажите полное имя этого файла после перемещения.",
            "answers": ["D:\Бaйкaл.png", "D:\Peклaмa\Бaйкaл.png", "D:\Реклама\Экскурсии\Байкал.png", "D:\Экcкypcии\Peклaмa\Бaйкaл.png"],
            "correct": "2"
        },
        {
            "answer": "В алгоритме, записанном ниже, используются переменные а и b. Символ «:=» обозначает оператор присваивания, знаки « + », «-», «*» и «/» — операции сложения, вычитания, умножения и деления. Правила выполнения операций и порядок действий соответствуют правилам арифметики. Определите значение переменной а после выполнения данного алгоритма: а := 7; b := 5+а; b := а+b+1; а := b/4*3-а.",
            "answers": ["8", "7", "10", "12"],
            "correct": "0"
        },
        {
            "answer": "У исполнителя Увеличитель две команды, которым присвоены номера: 1. прибавь 2; 2. умножь на 3. Первая из них увеличивает число на экране на 2, вторая увеличивает его в 3 раза. Составьте алгоритм получения из числа 7 числа 29, содержащий не более 5 команд. В ответе запишите только номера команд. (Например, 121 — это алгоритм: прибавь 2, умножь на 3, прибавь 2, который преобразует число 2 в число 14.). Если таких алгоритмов более одного, то запишите любой из них.",
            "answers": ["21112", "12122", "212", "121"],
            "correct": "3"
        },
        {
            "answer": "Файл размером 2 Мбайт передаётся через некоторое соединение за 64 секунды. Определите размер файла (в Кбайт), который можно передать через другое соединение с вдвое большей скоростью за 40 секунд. В ответе укажите одно число — размер файла в Кбайт. Единицы измерения писать не нужно.",
            "answers": ["512", "1024", "2560", "2048"],
            "correct": "2"
        },  
        {
            "answer": "Текст, набранный на компьютере, содержит 11 страниц, на каждой странице 40 строк, а в каждой строке по 64 символа. Определите информационный объем текста, если один символ кодируется 16 битами.",
            "answers": ["1800 бит", "55 Кбайт", "524 байта", "0,5 Кбайта"],
            "correct": "1"
        },
        {
            "answer": "Между железнодорожными станциями А, Б, В, Г, Д построены дороги, протяженность которых приведена в таблице: <img src='images/photo_1.jpg' class=\"question_image\"> Определите кратчайший путь между станциями А и Д (при условии, что двигаться можно только по построенным дорогам).",
            "answers": ["7", "8", "9", "10"],
            "correct": "2"
        },
        {
            "answer": "Переведите в биты 8 Гб.",
            "answers": ["536871913 бит", "2^35 бит", "524288 бит", "2^36 бит"],
            "correct": "3"
        },
        {
            "answer": "Запишите значение переменной s, полученное в результате работы следующей программы. Текст программы приведён на трёх языках программирования. <div><span>Алгоритмический язык</span><img src='images/photo_2.jpg' class=\"question_image\"></div><div><span>Бейсик</span><img src='images/photo_3.jpg' class=\"question_image\"></div><div><span>Паскаль</span><img src='images/photo_4.jpg' class=\"question_image\"></div>",
            "answers": ["3", "48", "0", "10"],
            "correct": "1"
        },
    ],
    "physics": [
        {
            "part": "Часть 1:",
            "answer": "1. Условия третьего закона Ньютона:<div><span>a) силы должны быть разной природы;</span></div><div><span>б) силы действуют в доль одной прямой;</span></div><div><span>в) силы приложены к разным телам.</span></div><div><span>Какое из условий неверно?</span></div>",
            "answers": ["a", "б", "в"],
            "correct": "0"
        },
        {
            "answer": "Период - это...",
            "answers": ["число колебаний в единицу времени", "время одного полного колебания", "положение колебательной системы в данный период времени"],
            "correct": "1"
        },
        {
            "answer": "Частота - это число колебаний в единицу времени. Это утверждение верно?",
            "answers": ["верно", "неверно"],
            "correct": "0"
        },
        {
            "answer": "Каким символом отображается сила?",
            "answers": ["g", "I", "F", "V"],
            "correct": "2"
        },
        {
            "answer": "Электрический ток - это...",
            "answers": ["физическая величина, характеризующая меру взаимодействия тел", "векторная, силовая характеристика тока", "направленное движение заряженных частиц"],
            "correct": "2"
        },
        {
            "answer": "Скольким амплитудам равен период?",
            "answers": ["4А", "2А", "0А", "10А"],
            "correct": "0"
        },
        {
            "answer": "Человеческое ухо воспринимает частоту от (1)... до (2)... Вставьте вместо пропусков нужные значения.",
            "answers": ["1) 20 Гц; 2) 20000 Гц", "1) 10 Гц; 2) 600 Гц", "1) 15 Гц; 2) 100 Гц", "1) 200 Гц; 2) 35000 Гц"],
            "correct": "0"
        },
        {
            "answer": "Формула нахождения периода.",
            "answers": ["I = U/R", "F = ma", "T = t/N"],
            "correct": "2"
        },
        {
            "answer": "Под действием каких сил происходят свободные колебания?",
            "answers": ["внешних сил системы", "внутренних сил системы", "другое..."],
            "correct": "1"
        },
        {
            "answer": "В каком направлении движется электрический ток?",
            "answers": ["от - к +", "от + к -"],
            "correct": "1"
        },
        {
            "part": "Часть 2:",
            "answer": "Мяч массой 0,1 кг подбросили вертикально вверх. В результате мяч поднялся на высоту 4 м, а затем упал обратно на землю. Чему равна работа силы тяжести на всём пути мяча?",
            "answers": ["0 Дж", "4 Дж", "-0.4 Дж", "-4 Дж"],
            "correct": "0"
        },
        {
            "answer": "Сравните силы давления человека на лёд, если в первом случае человек стоит на коньках, во втором случае — в обычных ботинках, в третьем случае — на лыжах.",
            "answers": ["на лыжах — наименьшая, на коньках — наибольшая", "на коньках — наименьшая, на лыжах — наибольшая", "в ботинках — наибольшая, на лыжах — наименьшая", "одинаковы"],
            "correct": "3"
        },
        {
            "answer": "Перед уколом медсестра протирает кожу пациента спиртом. При этом у человека возникает ощущение прохлады на коже. Какое утверждение правильно объясняет наблюдаемое явление?",
            "answers": ["При испарении жидкость забирает часть тепла у ладони.", "Молекулы жидкости, соприкасаясь с рукой, охлаждают её.", "Жидкость изолирует ладонь от соприкосновения с тёплым воздухом.", "При испарении внутренняя энергия жидкости увеличивается."],
            "correct": "0"
        },
        {
            "answer": "Подъёмный кран равномерно поднимает груз массой 100 кг на высоту 20 м. В первом случае груз поднимают за 40 с, во втором случае — за 20 с. Сравните работы, совершённые краном в первом и втором случаях.",
            "answers": ["А1 = А2", "А1 = 2А2", "А2 = 2А1", "А1 = 4А2"],
            "correct": "0"
        },
        {
            "answer": "Звуковая волна переходит из воды в воздух. Как меняются при этом частота и скорость звука?",
            "answers": ["частота не изменяется, скорость увеличивается", "частота не изменяется, скорость уменьшается", "частота увеличивается, скорость не изменяется", "частота уменьшается, скорость не изменяется"],
            "correct": "0"
        },
        {
            "answer": "Определите КПД подвижного блока, с помощью которого на стройке поднимают ведро с цементным раствором массой 20 кг, действуя на верёвку силой 110 Н.",
            "answers": ["35%", "91%", "89%", "50%"],
            "correct": "1"
        },
        {
            "answer": "При охлаждении стальной детали массой 200 г до температуры 52 °С выделилось 10 кДж энергии. Чему была равна температура стали до охлаждения? Q стали = 500 Дж / кг * °C",
            "answers": ["152°С", "100°С", "34°С", "257°С"],
            "correct": "0"
        },
        {
            "answer": "Три резистора, сопротивления которых R1 = 2 Ом, R2 = 4 Ом и R3 = 6 Ом, соединены последовательно. Вольтметр, подключённый к третьему резистору, показывает напряжение 18 В. Чему равно напряжение на всём участке цепи?",
            "answers": ["12 В", "52 В", "36 В", "37 В"],
            "correct": "2"
        },
        {
            "answer": "После удара бильярдный шар массой 125 г катится со скоростью 0,8 м/с и сталкивается с другим неподвижным шаром такой же массы. Определите суммарный импульс шаров после соударения.",
            "answers": ["100 кг * м/с", "0,1 кг * м/с", "10 кг * м/с", "не хватает данных для решения задачи"],
            "correct": "1"
        },
        {
            "answer": "В стакан, содержащий лёд при температуре 0 °С, налили 100 г воды, имеющей температуру 33 °С. Какова масса льда, если весь лёд растаял и в стакане установилась температура 0 °С? Теплообменом с окружающим воздухом пренебречь. Ответ приведите в граммах. Q воды = 4200 Дж / кг * °C; λ льда = 3,3 * 10^5 Дж/кг",
            "answers": ["58", "41", "23", "42"],
            "correct": "3"
        },
    ]
};

let activeTest = null;
let testResults = null;

document.addEventListener('DOMContentLoaded', function () {
    /** Тест по математике */
    const mathForm = document.getElementById("maths");
    if (mathForm) {
        activeTest = "maths";

        testResults = JSON.parse(window.localStorage.getItem(activeTest));
        if (!testResults) {
            for (let i = 0; i < results.maths.length; i++) {
                let element = results.maths[i];

                if (element.part) {
                    mathForm.append(createPart(element.part));
                }

                mathForm.append(createAnswer(results.maths[i], i));
            }

            mathForm.append(createSubmitButton());
        } else {
            mathForm.append(createRetryButton());
        }
    }

    /** Тест по русскому языку */
    const russianForm = document.getElementById("russian_language");
    if (russianForm) {
        activeTest = "russian_language";

        testResults = JSON.parse(window.localStorage.getItem(activeTest));
        if (!testResults) {
            for (let i = 0; i < results.russian_language.length; i++) {
                let element = results.russian_language[i];

                if (element.part) {
                    russianForm.append(createPart(element.part));
                }

                russianForm.append(createAnswer(results.russian_language[i], i));
            }

            russianForm.append(createSubmitButton());
        } else {
            russianForm.append(createRetryButton());
        }
    }

    /** Тест по информатике */
    const informForm = document.getElementById("informatics");
    if (informForm) {
        activeTest = "informatics";

        testResults = JSON.parse(window.localStorage.getItem(activeTest));
        if (!testResults) {
            for (let i = 0; i < results.informatics.length; i++) {
                let element = results.informatics[i];

                if (element.part) {
                    informForm.append(createPart(element.part));
                }

                informForm.append(createAnswer(results.informatics[i], i));
            }

            informForm.append(createSubmitButton());
        } else {
            informForm.append(createRetryButton());
        }
    }

    /** Тест по физике */
    const physicForm = document.getElementById("physics");
    if (physicForm) {
        activeTest = "physics";

        testResults = JSON.parse(window.localStorage.getItem(activeTest));
        if (!testResults) {
            for (let i = 0; i < results.physics.length; i++) {
                let element = results.physics[i];

                if (element.part) {
                    physicForm.append(createPart(element.part));
                }

                physicForm.append(createAnswer(results.physics[i], i));
            }

            physicForm.append(createSubmitButton());
        } else {
            physicForm.append(createRetryButton());
        }
    }

    // Слушатель для клика по внешней области попапа
    let popupWrapper = document.getElementById('popup');
    if (popupWrapper) popupWrapper.addEventListener('click', closePopup);

    // Слушатель для закрытия попапа
    let closer = document.querySelector(".closer");
    if (closer) closer.addEventListener('click', closePopup);

    if (testResults) {
        createResults();
    }

    // Плавный scroll к элементам
    document.querySelectorAll('a[href^="#"').forEach(link => {

        link.addEventListener('click', function(e) {
            e.preventDefault();

            let href = this.getAttribute('href').substring(1);

            const scrollTarget = document.getElementById(href);

            //const topOffset = document.querySelector('.scrollto').offsetHeight;
            const topOffset = 0; // если не нужен отступ сверху
            const elementPosition = scrollTarget.getBoundingClientRect().top;
            const offsetPosition = elementPosition - topOffset;

            window.scrollBy({
                top: offsetPosition,
                behavior: 'smooth'
            });
        });
    });
});

function createPart(text) {
    let p = document.createElement('p');
    p.className = "question_part";

    p.innerHTML = text;

    return p;
}

function createSubmitButton() {
    let btn = document.createElement('button');
    btn.className = "button_submit";
    btn.type = 'submit';
    btn.innerText = "Отправить";

    return btn;
}

function createRetryButton() {
    let btn = document.createElement('button');
    btn.className = "button_retry";
    btn.innerText = "Пройти тест заново";
    btn.addEventListener('click', removeResults);

    return btn;
}

function createAnswer(answer, i) {
    let div = document.createElement('div');
    div.className = "question_wrapper";

    let p = document.createElement('p');
    p.className = "question";
    p.innerHTML = `${i+1}. ${answer.answer}`;

    div.append(p);

    let ul = document.createElement("ul");
    ul.className = "question-answers-list";
    for (let j = 0; j < answer.answers.length; j++) {
        let li = document.createElement("li");
        li.className = "question-answer";

        let label = document.createElement("label");

        let input = document.createElement("input");
        input.type = "radio";
        input.name = "answer" + i;
        input.value = j;

        label.append(input);
        label.append(answer.answers[j]);

        li.append(label);

        ul.append(li);
    }

    div.append(ul);

    return div;
}

function formProcessing() {
    let obResult = {
        "errors": [],
        "success": 0
    };

    for (let i = 0; i < results[activeTest].length; i++) {
        let element = document.querySelector("input[name=answer" + i + "]:checked");

        if (!element) {
            let popup = document.getElementById('popup');

            let popupTextBlock = popup.querySelector(".popup_text");
            popupTextBlock.innerHTML = "Вы не заполнили вопрос номер " + (i + 1);

            popup.style.display = "flex";
            return;
        } else {
            if (element.value == results[activeTest][i].correct) {
                obResult.success++;
            } else {
                let errorText = `<i><b>Вопрос ${i + 1}: ${results[activeTest][i].answer}</b></i><br/>
                                Вы ответили: <b style="color: red;">${results[activeTest][i].answers[element.value]}</b><br/>
                                Правильный ответ: <b style="color: #76bc21;">${results[activeTest][i].answers[results[activeTest][i].correct]}</b><br/><br/>`;

                obResult.errors.push(errorText);
            }
        }
    }

    if (obResult.errors.length > 0) obResult.errors.unshift(`<p>Вы допустили ошибки в следующий вопросах:</p>`);

    if (!window.localStorage.getItem(activeTest)) window.localStorage.setItem(activeTest, JSON.stringify(obResult));

    testResults = JSON.parse(window.localStorage.getItem(activeTest));

    createResults();
}

function createResults() {
    if (!testResults) return;

    let div = document.querySelector('.test-result');
    if (!div) {
        div = document.createElement('div');
        div.className = "test-result";
        document.body.append(div);
    }

    div.innerHTML = "";

    let success = document.createElement('div');
    success.className = "test-result-success";
    success.innerHTML = `Вы правильно ответили на ${testResults.success} вопрос(ов) из ${results[activeTest].length}`;
    div.append(success);

    let successPersent = Math.floor(testResults.success / results[activeTest].length * 100);
    let mark = 2;

    if (successPersent > 25 && successPersent <= 60) {
        mark = 3;
    } else if (successPersent > 60 && successPersent <= 85) {
        mark = 4;
    } else if (successPersent > 85) {
        mark = 5;
    }

    let result = document.createElement('div');
    result.className = "test-result-percent";
    if (successPersent <= 60) {
        result.classList.add("fail");
        result.innerHTML = `Вы набрали ${successPersent}%. Ваша оценка: ${mark}. Вывод: вам следует подтянуть ваши знания.`;
    } else {
        result.classList.add("success");
        result.innerHTML = `Вы набрали ${successPersent}%. Ваша оценка: ${mark}. Вывод: поздравляю, вы сдали ОГЭ.`;
    }
    
    div.append(result);

    let errors = document.createElement('div');
    errors.className = "test-result-errors";
    errors.innerHTML = testResults.errors.reduce((el1, el2) => el1 + el2, "");
    div.append(errors);

    // Плавный скролл к результатам
    const topOffset = 100; // если не нужен отступ сверху
    const elementPosition = div.getBoundingClientRect().top;
    const offsetPosition = elementPosition - topOffset;

    window.scrollBy({
        top: offsetPosition,
        behavior: 'smooth'
    });
}

function removeResults(e) {
    e.preventDefault();

    if (!activeTest) return;

    window.localStorage.removeItem(activeTest);

    window.location.reload();
}

function closePopup(event) {
    event.preventDefault();

    if (event.target.className === 'popup_wrapper' || event.target.className === 'closer') {
        let popup = document.getElementById('popup');
        popup.style.display = 'none';
    }
}